[{
  "_id": {
    "$oid": "5fd9ab94448e728b2ae5c0cf"
  },
  "imagePath": "images/a1.png",
  "title": "2018 Alfa Romeo Stelvio",
  "t2": "Ti Sport Utility",
  "year": 2018,
  "price": 48600,
  "priceStr": "48,600",
  "topspeed": "144",
  "time60": "5.4",
  "mileage": "24",
  "engine": 2,
  "cyl": 4,
  "gearbox": "8-Speed",
  "transmission": "Automatic",
  "colour": "Montecarlo Blue",
  "interior": "Black Leather Interior",
  "body": "4 Door SUV",
  "drivetrain": "AWD",
  "wheel": "18'' Spoke Wheels",
  "description": "The Stelvio delivers uncompromising performance with an engine that produces Best-in-Class standard 280 horsepower and Best-in-Class standard 306 pound-feet torque for a heart-racing Best-in-Class 5.4-second 0-60 mph time with all-wheel-drive models",
  "safety": "Safety and security features included in the available Active Driver Assistance Package use visual and audio cues to help alert drivers to hazardous situations, as well as intuitive design to help decrease distraction",
  "technology": "A standard 8.8-inch touchscreen puts all your multimedia and Navigation in one conveniently accessible place. Available wireless phone charging brings the latest technology to the cabin of the Stelvio, helping to eliminate cable clutter and increase functionality and convenience.The available hands-free power liftgate makes loading cargo simple and easy"
},{
  "_id": {
    "$oid": "5fd9b952448e728b2ae5c273"
  },
  "imagePath": "images/au1.jpg",
  "title": "2020 Audi A6",
  "t2": "TSFI Premium PLus",
  "year": 2020,
  "price": 53900,
  "priceStr": "53,900",
  "topspeed": "155",
  "time60": "5.3",
  "mileage": "22",
  "engine": 3,
  "cyl": 6,
  "gearbox": "7-Speed Dual-Clutch",
  "transmission": "Automatic",
  "colour": "Daytona Gray",
  "interior": "Black Interior",
  "body": "4 Door Sedan",
  "drivetrain": "AWD",
  "wheel": "20'' 5-V Wheels",
  "description": "The Audi A6 Sedan combines these values into an exceptionally sporty and elegant symbiosis. The Audi TFSI engines represent outstanding efficiency and improved performance while at the same time retaining their dynamism. The 2.0 TFSI 180 kW (245 bhp) in combination with the 7 Speed gearbox accelerates from 0 to 60 km/h in just 5.3 seconds",
  "safety": "Safety and security features included in the available Active Driver Assistance Package use visual and audio cues to help alert drivers to hazardous situations, as well as intuitive design to help decrease distraction",
  "technology": "Full control of the Driver Information System and the Audi Virtual Cockpit from the steering wheel.A seamless connection between vehicle and smartphone. The innovative smartphone interface uses Apple CarPlay and Android Auto. The successful model is now taking perfection with highly integrated assistance systems and further optimised convenience features."
},{
  "_id": {
    "$oid": "5fd9bc84448e728b2ae5c2bd"
  },
  "imagePath": "images/fi1.jpg",
  "title": "2017 Fiat 124Spider",
  "t2": "Classica Convertible",
  "year": 2017,
  "price": 27300,
  "priceStr": "27,300",
  "topspeed": "141",
  "time60": "6.4",
  "mileage": "29",
  "engine": 1.4,
  "cyl": 4,
  "gearbox": "6-Speed",
  "transmission": "Manual",
  "colour": " Meteor Grey",
  "interior": "Nero Black Interior",
  "body": "2 Door Convertible",
  "drivetrain": "RWD",
  "wheel": "16'' Silver Wheels",
  "description": "The FIAT 1.4L MultiAir Turbo four-cylinder with twin intercoolers delivers up to 164 hp and 184 lb-ft of torque, and can be teamed with either the standard six-speed manual or available six-speed automatic transmission. The FIAT 124 Spider gets to peak power and torque at a much lower rpm than any vehicle in its class",
  "safety": "It all starts with dual-stage front air bags. In addition, supplemental seat-mounted side air bags cushion impacts for all passengers.",
  "technology": "With FIAT Connect 7.0, you’ll enjoy at large via an advanced available multimedia system with a 7-inch full-color touchscreen display. MP3 player and six speakers create the soundtrack of your drive. Stay fully plugged in with a Multimedia Control Knob, Bluetooth Communication System lets you take phone calls and stream music without lifting a finger. Available GPS Navigation,ParkView, Rear Back-Up Camera help you keep your bearings."
},{
  "_id": {
    "$oid": "5fd9df43448e728b2ae5c595"
  },
  "imagePath": "images/je.jpg",
  "title": "2017 Jeep Cherokee",
  "t2": "Latitude Sport Utility",
  "year": 2017,
  "price": 25200,
  "priceStr": "25,200",
  "topspeed": "180",
  "time60": "7.6",
  "mileage": "25",
  "engine": 2.4,
  "cyl": 4,
  "gearbox": "9-Speed",
  "transmission": "Automatic",
  "colour": "Billet Silver",
  "interior": "Cloth Bucket Interior",
  "body": "4 Door SUV",
  "drivetrain": "FWD",
  "wheel": "16'' Silver Wheels",
  "description": "The available 2.0L Turbo engine provides an impressive 270 horsepower when equipped with a nine-speed automatic transmission. 295 pound-feet of torque gives the 2.0L Turbo engine a towing capacity of up to 4,000 pounds and a fuel economy rating of up to 31 highway mpg",
  "safety": "Bring peace of mind every time you drive. Cherokee is designed to help watch your back and keep you on the right path. Blind Spot Monitoring, radar sensors, Electronic Stability Control maintain vehicle control to help keep you and your loved ones safe and secure",
  "technology": "The available Uconnect® 4C NAV includes an 8.4-inch touchscreen with Carplay and Auto suppport integration, Navigation and drag and drop functionality to help keep you in control of the things that matter. SiriusXM Guardian connects you to your vehicle, allowing you to lock and unlock doors, start your vehicle remotely, activate the horn to locate your vehicle at the touch of a button from the mobile app."
},{
  "_id": {
    "$oid": "5fd9e766448e728b2ae5c649"
  },
  "imagePath": "images/do.png",
  "title": "2019 Dodge Challenger",
  "t2": "RT Pack Coupe",
  "year": 2019,
  "price": 38900,
  "priceStr": "38,900",
  "topspeed": "169",
  "time60": "3.4",
  "mileage": "18",
  "engine": 6.4,
  "cyl": 8,
  "gearbox": "8-Speed Dual-Clutch",
  "transmission": "Automatic",
  "colour": "Redline Red",
  "interior": "Houndstooth Interior",
  "body": "2 Door Coupe",
  "drivetrain": "RWD",
  "wheel": "20'' BlackNoise Wheels",
  "description": "The Challenger Redeye draws its anger from a Supercharged 6.4L HEMI® V8 engine.  Challenger with 717/707 horsepower, that provides 656 lb-ft of torque run a staggering quarter-mile time and are arguably two of the most coveted performance vehicles on the road. These powerhouses use upgraded components that can withstand the brutal performance they are capable of unleashing",
  "safety": "There’s no room for error when it comes to driver safety and the Dodge Challenger has features to help keep you safe and secure should something happen. Electronic Stability Control helps you maintain directional control whenever needed.",
  "technology": "The available Uconnect® 4C NAV comes packed with features that make it easy to stay connected, like Navigation, the largest available 8.4-inch touchscreen in its class, Hands-Free Calling, an available 4G LTE Wi-Fi Hotspot and more."
},{
  "_id": {
    "$oid": "5fda1f57448e728b2ae5c7a7"
  },
  "imagePath": "images/mus.jpg",
  "title": "2019 Ford Mustang",
  "t2": "GT350 Coupe",
  "year": 2019,
  "price": 58100,
  "priceStr": "58,100",
  "topspeed": "185",
  "time60": "3.5",
  "mileage": "19",
  "engine": 5,
  "cyl": 8,
  "gearbox": "6-Speed SelectShift",
  "transmission": "Automatic",
  "colour": "Twister Orange",
  "interior": "Leather Trimmed Interior",
  "body": "2 Door Coupe",
  "drivetrain": "RWD",
  "wheel": "18'' Aluminium Wheels",
  "description": "The Shelby GT350 is designed to achieve lightning-fast performance. Every system, component and shape is designed and optimized so that all the parts work in balanced harmony. The hand-assembled 5 L Ti-VCT V8 with a flat-plane crankshaft found on the 2019 Ford GT350 is the most powerful naturally aspirated engine with redline of 8,250 rpm, it’s also the highest-revving production V8 Ford",
  "safety": "The GT350 comes with 3-point safety belt restraint system for all seating positions, Glove-Box-Door-Integrated Knee Airbag,AdvanceTrac® with Electronic Stability Control, Belt-Minder front safety belt reminder Driver's knee airbag Dual front airbags and Front-seat side-impact airbags",
  "technology": "Track Apps features electronic line-lock and launch control and provides performance metrics instantly on the 4.2-inch message center in the instrument cluster and Voice-Activated Navigation System with pinch-to-zoom capability"
},{
  "_id": {
    "$oid": "5fda24b1448e728b2ae5c823"
  },
  "imagePath": "images/rap.png",
  "title": "2019 Ford F150 Raptor",
  "t2": "XL Pickup",
  "year": 2019,
  "price": 57900,
  "priceStr": "57,900",
  "topspeed": "134",
  "time60": "5.1",
  "mileage": "16",
  "engine": 3.5,
  "cyl": 6,
  "gearbox": "10-Speed",
  "transmission": "Automatic",
  "colour": "Rapid Red",
  "interior": "Black Cloth Interior",
  "body": "4 Door Truck",
  "drivetrain": "AWD",
  "wheel": "17'' CastAlum Wheels",
  "description": "Going from mild to wild on the most unforgiving terrain is where the Baja-bred F-150 Raptor excels with its extraordinary capability, beginning with raw power. Under the unique Raptor hood is the 24-valve, 3.5L twin-turbo HO EcoBoost with Ford port-fuel and direct-injection system and 10-speed automatic, generating a massive best-in-class* 450 horsepower and 510 lb.-ft. of torque.",
  "safety": "The GT350 comes with 3-point safety belt restraint system for all seating positions, Glove-Box-Door-Integrated Knee Airbag,AdvanceTrac® with Electronic Stability Control, Belt-Minder front safety belt reminder Driver's knee airbag Dual front airbags and Front-seat side-impact airbags",
  "technology": "Track Apps features electronic line-lock and launch control and provides performance metrics instantly on the 4.2-inch message center in the instrument cluster and Voice-Activated Navigation System with pinch-to-zoom capability"
},{
  "_id": {
    "$oid": "5fda2891448e728b2ae5c8a0"
  },
  "imagePath": "images/bmw.jpg",
  "title": "2019 BMW 5 Series",
  "t2": "530 xDrive Sedan",
  "year": 2019,
  "price": 44600,
  "priceStr": "44,600",
  "topspeed": "148",
  "time60": "4.3",
  "mileage": "23",
  "engine": 2,
  "cyl": 4,
  "gearbox": "8-Speed Dual-Clutch",
  "transmission": "Automatic",
  "colour": "Jet Black",
  "interior": "Dakota Leather Interior",
  "body": "4 Door Sedan",
  "drivetrain": "AWD",
  "wheel": "18'' Alloy Wheels",
  "description": "The BMW 5 Series displays motorway dynamics and elegance in a perfect combination. A combination of the latest generation of common-rail direct injection, multi-stage turbocharging and variable turbine geometry in the BMW 530d produces and impressive 195 kW and enables a maximum torque of 620 Nm even from 2,000 rpm. ",
  "safety": "The BMW 5 Series comes with an array of safety features, which ensures the safety of the occupants in accidents. The 5 Series gets Airbags for driver and front passenger, Head airbags front and rear, Side airbags for driver and front passenger, Anti-lock Braking System (ABS), Cornering Brake Control (CBC), Dynamic Stability Control ",
  "technology": "The BMW Display Key is a smart piece of technology that connects you to your BMW 5 Series. A remote control and a touchscreen display in one, you can use it to park your vehicle, check your fuel, set the cabin temperature and see whether your BMW 5 Series is locked. And for those that prefer something simpler, the BMW 5 Series also comes with two conventional remote keys.The full-colour BMW Head-Up Display projects information that is situation-specific and relevant to the journey directly into the driver's field of vision, thereby allowing him or her to fully concentrate on driving"
},{
  "_id": {
    "$oid": "5fda2e52448e728b2ae5c982"
  },
  "imagePath": "images/kia.png",
  "title": "2019 Kia Sorento",
  "t2": "EX Sport Utility",
  "year": 2019,
  "price": 36900,
  "priceStr": "36,900",
  "topspeed": "123",
  "time60": "9.6",
  "mileage": "26",
  "engine": 3.3,
  "cyl": 6,
  "gearbox": "8-Speed",
  "transmission": "Automatic",
  "colour": "Gravity Gray",
  "interior": "Black Interior",
  "body": "4 Door SUV",
  "drivetrain": "FWD",
  "wheel": "18'' Alloy Wheels",
  "description": "The Sorento Hybrid is fitted with a 1.6-litre turbo petrol engine and a 59bhp electric motor, giving it a combined total of 226bhp. It's mated to a six-speed automatic gearbox and 0-60mph takes 9.6 seconds",
  "safety": "Passengers are protected by an arc of airbags that are deployed and inflated intelligently based on the severity of certain impacts.Passengers are protected by an arc of airbags that are deployed and inflated intelligently based on the severity of certain impacts.",
  "technology": "UVO eServices Premium Navigation 8'' touch screen supports Apple CarPlayTM4 & Android AutoTM5 along with Harman Kardon premium audio surround-sound system w/12 speakers and Rear-Camera Display SVM can display your vehicle’s surroundings on your device so that you can find your bearings and feel more secure"
},{
  "_id": {
    "$oid": "5fda32f1448e728b2ae5c9f0"
  },
  "imagePath": "images/honda.jpg",
  "title": "2018 Honda Accord",
  "t2": "LX Sedan",
  "year": 2018,
  "price": 24300,
  "priceStr": "24,300",
  "topspeed": "125",
  "time60": "7.6",
  "mileage": "26",
  "engine": 2.4,
  "cyl": 4,
  "gearbox": "10-Speed",
  "transmission": "Automatic",
  "colour": "Modern Steel",
  "interior": "Black Fabric Interior",
  "body": "4 Door Sedan",
  "drivetrain": "FWD",
  "wheel": "16'' Alloy Wheels",
  "description": "The power of Honda is derived from its expertly crafted, technologically advanced and innovative powertrain. The new Honda Accord Hybrid features 2.4 Litres Atkinson Cycle DOHC i-VTEC engine with a peak combined output of 215 ps and a fuel economy of 23.1 km/l, the Accord Hybrid will be at the top of its class.",
  "safety": "Every Accord features our latest-generation ACETM body structure and standard features that are all designed to help protect everyone. Accord has an impressive history of 5-Star Overall Vehicle Scores with features like anti-lock brakes, forward collision warning, vehicle stability assist.",
  "technology": "The world in a swipe, tap or pinch. The Honda Accord Hybrid offers you an intuitive high definition touchscreen display system. Equipped with a satellite-linked navigation system, an in-built Wifi receiver for internet browsing and infotainment features, it lets you get to your destination in one smooth drive."
}]